Rocontento/HomeKey-ESP32/main/NfcManager.cpp
#include "NfcManager.hpp"
#include "ReaderDataManager.hpp"
#include "ddk/homekey/ProfileFactory.h"
#include "ddk/session/AuthOutcome.h"
#include "ddk/session/Flow.h"
#include "ddk/session/Session.h"
#include "ddk/store/CredentialStore.h"
#include "ddk/transport/NfcChannel.h"
#include "esp32-hal.h"
#include "esp_log_buffer.h"
#include "esp_log_level.h"
#include "eventStructs.hpp"
#include "fmt/ranges.h"
#include "freertos/idf_additions.h"
#include "Pn532Reader.hpp"
#include "Pn7160Reader.hpp"
#include "St25r3916Reader.hpp"
#include "hal/gpio_types.h"
#include "magic_enum.hpp"
#include "utils.hpp"

#include <array>
#include <cstdint>
#include <esp_log.h>
#include <chrono>
#include <functional>
#include <memory>
#include <serialization.hpp>

const char* NfcManager::TAG = "NfcManager";

static const uint8_t ECP_HEAD[] = { 0x6A, 0x2, 0xCB, 0x2, 0x6, 0x2, 0x11, 0x00 };

void NfcManager::invalidateAuthCache() {
  if (!m_hkAuthPrecomputeEnabled) {
    return;
  }
  m_readerDataGeneration.fetch_add(1, std::memory_order_relaxed);
}

std::unique_ptr<ddk::Session> NfcManager::buildAuthSession() {
  std::function<bool(std::vector<uint8_t>&, std::vector<uint8_t>&)> nfcFn =
      [this](std::vector<uint8_t>& send, std::vector<uint8_t>& recv) -> bool {
        if (!m_reader || send.size() > 255) {
          return false;
        }
        const bool ok = m_reader->exchangeApdu(send, recv, 1000);
        // Diagnostic: a reply that is only a status word (no payload) is
        // otherwise logged upstream as "<empty>", hiding whether the phone
        // answered e.g. 6985 (not armed) or the reader reported an RF error.
        if (ok && recv.size() <= 2) {
          ESP_LOGW(TAG, "APDU %02X%02X answered with status-only reply: %s",
                   send.size() > 0 ? send[0] : 0, send.size() > 1 ? send[1] : 0,
                   recv.empty() ? "(none)" : fmt::format("{:02X}", fmt::join(recv, "")).c_str());
        } else if (!ok) {
          m_linkError = true;
          ESP_LOGW(TAG, "APDU %02X%02X exchange failed at reader level",
                   send.size() > 0 ? send[0] : 0, send.size() > 1 ? send[1] : 0);
        }
        return ok;
      };
  ddk::SessionConfig config;
  config.target_flow = authFlow;
  // Constructing the Session runs mbedTLS P-256 ephemeral key generation
  // (~50 ms on ESP32) -- the cost precompute moves off the tap path.
  return std::make_unique<ddk::Session>(
      std::make_shared<ddk::NfcChannel>(nfcFn), m_readerDataManager, config);
}

/**
 * @brief Construct and initialize an NfcManager, set up ECP data and event wiring.
 *
 * Initializes internal state, registers the NFC bus topic, and subscribes to HomeKit/internal
 * events so that ACCESSDATA_CHANGED updates ECP data and invalidates the auth cache, and
 * DEBUG_AUTH_FLOW updates the debug authentication flow when received.
 *
 * @param readerDataManager Reference to the ReaderDataManager used to read and persist reader data.
 * @param nfcGpioPins Four GPIO pin numbers used for SPI communication (SS/CS, SCK, MISO, MOSI).
 * @param nfcReaderType 0 = PN532 (SPI), 1 = PN7160, 2 = ST25R3916 (I2C).
 * @param nfcIrqPin IRQ pin for PN7160 (255 = unset).
 * @param nfcVenPin VEN pin for PN7160 (255 = unset).
 * @param hkAuthPrecomputeEnabled If true, enables HomeKit authentication precompute behavior.
 * @param nfcFastPollingEnabled If true, shortens the delay between polling iterations.
 */
NfcManager::NfcManager(NvsCredentialStore& readerDataManager,
                       const std::array<uint8_t, 4> &nfcGpioPins,
                       uint8_t nfcReaderType,
                       uint8_t nfcIrqPin,
                       uint8_t nfcVenPin,
                       bool hkAuthPrecomputeEnabled,
                       bool nfcFastPollingEnabled)
    : nfcGpioPins(nfcGpioPins),
      m_nfcReaderType(nfcReaderType),
      m_nfcIrqPin(nfcIrqPin),
      m_nfcVenPin(nfcVenPin),
      m_readerDataManager(readerDataManager),
      m_hkAuthPrecomputeEnabled(hkAuthPrecomputeEnabled),
      m_nfcFastPollingEnabled(nfcFastPollingEnabled),
      m_pollingTaskHandle(nullptr),
      m_retryTaskHandle(nullptr)
{
  std::copy(ECP_HEAD, ECP_HEAD + 8, m_ecpData.begin());
  if (nfcReaderType == ST25R3916) {
    pinAllocations.emplace(PinFunctions::SDA, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[0]), GPIO_MODE_DISABLE, "I2C_SDA"));
    pinAllocations.emplace(PinFunctions::SCL, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[1]), GPIO_MODE_DISABLE, "I2C_SCL"));
  } else {
    pinAllocations.emplace(PinFunctions::SS, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[0]), GPIO_MODE_DISABLE, "SPI2_SS"));
    pinAllocations.emplace(PinFunctions::SCK, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[1]), GPIO_MODE_DISABLE, "SPI2_SCK"));
    pinAllocations.emplace(PinFunctions::MISO, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[2]), GPIO_MODE_DISABLE, "SPI2_MISO"));
    pinAllocations.emplace(PinFunctions::MOSI, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[3]), GPIO_MODE_DISABLE, "SPI2_MOSI"));
  }
  if (nfcReaderType == PN7160){
    if(nfcIrqPin != 255)
      pinAllocations.emplace(PinFunctions::IRQ, GPIOAllocator::instance().acquire(gpio_num_t(nfcIrqPin), GPIO_MODE_DISABLE, "NFC_IRQ"));
    if(nfcVenPin != 255)
      pinAllocations.emplace(PinFunctions::VEN, GPIOAllocator::instance().acquire(gpio_num_t(nfcVenPin), GPIO_MODE_DISABLE, "NFC_VEN"));
  }
  for(auto &p : pinAllocations){
    if(!p.second.has_value()){
      ESP_LOGW(TAG, "Could not acquire GPIO Pin for '%s' with error '%s'", magic_enum::enum_name(p.first).cbegin(), magic_enum::enum_name(p.second.error()).cbegin());
    }
  }
  m_hk_event = AppEventLoop::subscribe(HK_EVENT, HK_INTERNAL_EVENT, [&](const uint8_t* data, size_t size){
    if(size == 0 || data == nullptr) return;
    std::span<const uint8_t> payload(data, size);
    std::error_code ec;
    HomekitEvent hk_event = alpaca::deserialize<HomekitEvent>(payload, ec);
    if(ec) { ESP_LOGE(TAG, "Failed to deserialize HomeKit event: %s", ec.message().c_str()); return; }
    switch(hk_event.type) {
      case ACCESSDATA_CHANGED: {
        const auto& readerGid = readerDataManager.reader_identity().group_identifier;
        if (readerGid.size() == 8) {
            std::copy(ECP_HEAD, ECP_HEAD + 8, m_ecpData.begin());
            memcpy(m_ecpData.data() + 8, readerGid.data(), 8);
            Utils::crc16a(m_ecpData.data(), 16, m_ecpData.data() + 16);
        } else {
            std::fill(m_ecpData.begin(), m_ecpData.end(), 0);
        }
        
        m_reconfigRequested.store(true, std::memory_order_release);
        invalidateAuthCache();
      }
      break;
      case DEBUG_AUTH_FLOW: {
        EventValueChanged s = alpaca::deserialize<EventValueChanged>(hk_event.data, ec);
        if(!ec){
          authFlow = ddk::Flow(s.newValue);
          // Cached sessions bake target_flow into their SessionConfig at
          // construction, so drop any built for the previous flow.
          invalidateAuthCache();
        } else {
          ESP_LOGE(TAG, "Failed to deserialize debug auth flow event: %s", ec.message().c_str());
          return;
        }
      }
      break;
      default:
        break;
    }
  });
}

