Rocontento/HomeKey-ESP32/main/NfcManager.cpp
    // Link-level retry. With the PN532 the first exchange right after
    // activation sometimes dies with an RF protocol error (PN532 status 0x0B)
    // on the SELECT or on Auth0, while the very next attempt succeeds. Rather
    // than dropping the tag and letting the phone time out with an error on
    // screen, re-activate it and try again within ~100 ms. Only ISO-DEP tags
    // (SAK bit 0x20) are retried: a MIFARE Classic never answers an APDU and
    // must keep reaching the generic-tag path immediately.
    const bool isoDep = (sak & 0x20) != 0;
    const int maxAttempts = isoDep ? 1 + kLinkErrorRetries : 1;

    for (int attempt = 0; attempt < maxAttempts; ++attempt) {
        if (attempt > 0) {
            ESP_LOGW(TAG, "Link error, re-activating tag (retry %d/%d)", attempt, kLinkErrorRetries);
            m_reader->releaseTag();
            vTaskDelay(pdMS_TO_TICKS(kLinkErrorRetryDelayMs));
            std::vector<uint8_t> uid2;
            std::array<uint8_t,2> atqa2;
            uint8_t sak2 = 0;
            if (!m_reader->pollForTag(uid2, atqa2, sak2, 100)) {
                ESP_LOGW(TAG, "Tag no longer present, giving up retry.");
                break;
            }
        }

        m_linkError = false;
        std::vector<uint8_t> response;
        const bool ok = m_reader->exchangeApdu(selectAppletCmd, response, 500);
        if (!ok) {
            // Reader-level failure (transport or PN532 error), the tag never
            // answered. Retry if we can; otherwise fall through to the generic
            // path below on the last attempt so behaviour for odd tags is kept.
            m_linkError = true;
            if (attempt + 1 < maxAttempts) continue;
            ESP_LOGW(TAG, "SELECT failed at reader level after %d attempt(s).", attempt + 1);
            ESP_LOGD(TAG, "Passive target UID: %s (%zu)", fmt::format("{:02X}", fmt::join(uid, "")).c_str(), uid.size());
            handleGenericTag(uid, atqa, sak);
            break;
        }

        // Check for success SW1=0x90, SW2=0x00
        if (response.size() >= 2 && response[response.size() - 2] == 0x90 && response[response.size() - 1] == 0x00) {
            ESP_LOG_BUFFER_HEX_LEVEL(TAG, response.data(), response.size(), ESP_LOG_DEBUG);
            ESP_LOGI(TAG, "HomeKey applet selected successfully.");
            m_linkError = false;
            handleHomeKeyAuth(response);
            // Auth failed because the link broke mid-flow (not because the
            // phone rejected us): run the whole thing again on a fresh
            // activation. The phone has not seen any control-flow command in
            // this case, so a new transaction is clean.
            if (m_lastTxnOutcome == TxnOutcome::Failure && m_linkError && attempt + 1 < maxAttempts) {
                continue;
            }
            break;
        }

        // The tag answered, just not with our applet: a real non-HomeKey tag.
        ESP_LOGI(TAG, "Not a HomeKey tag, or failed to select applet.");
        ESP_LOGD(TAG, "Passive target UID: %s (%zu)", fmt::format("{:02X}", fmt::join(uid, "")).c_str(), uid.size());
        handleGenericTag(uid, atqa, sak);
        break;
    }

    auto stopTime = std::chrono::high_resolution_clock::now();
    ESP_LOGI(TAG, "Total processing time: %lli ms", std::chrono::duration_cast<std::chrono::milliseconds>(stopTime - startTime).count());
    // Headroom check. This task runs mbedTLS P-256 operations (ECDH, ECDSA) on
    // top of the reader's frame buffers, and an overflow here would look
    // exactly like the observed symptom: a reboot part-way through a
    // transaction. Reported every time so a downward trend is visible.
    const UBaseType_t stackFreeWords = uxTaskGetStackHighWaterMark(nullptr);
    if (stackFreeWords < 512) {
      ESP_LOGW(TAG, "nfc task stack headroom LOW: %u bytes free",
               (unsigned)(stackFreeWords * sizeof(StackType_t)));
    } else {
      ESP_LOGD(TAG, "nfc task stack headroom: %u bytes free",
               (unsigned)(stackFreeWords * sizeof(StackType_t)));
    }
    ESP_LOGD(TAG, "heap: %u free, %u min-ever", (unsigned)esp_get_free_heap_size(),
             (unsigned)esp_get_minimum_free_heap_size());

}

/**
 * @brief Block until the active tag leaves the reader's RF field.
 *
 * Spins on `isTagStillPresent()` with a 60 ms delay between checks.  If the
 * tag is not removed within 10 seconds, the reader is force-released and the
 * function returns to avoid an infinite loop.
 */
void NfcManager::waitForTagRemoval() {
    if (!m_reader) return;
    TickType_t start = xTaskGetTickCount();
    while (m_reader->isTagStillPresent()) {
        if ((xTaskGetTickCount() - start) * portTICK_PERIOD_MS > 10000) {
            ESP_LOGW(TAG, "Tag removal wait timed out, forcing release.");
            m_reader->releaseTag();
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(60));
    }
    m_reader->releaseTag();
}

/**
 * @brief Attempt HomeKey authentication for the currently-present NFC tag.
 *
 * Performs the configured HomeKey authentication flow for the active tag and publishes a HOMEKEY_TAP
 * event describing the outcome. On successful authentication, stored reader data may be updated.
 *
 * If HomeKey precomputation is enabled, a precomputed authentication session may be consumed (when
 * generation matches current reader data); otherwise a fresh ("cold") authentication session is used.
 *
 * Side effects: may update ReaderDataManager, publish a HOMEKEY_TAP event on the NFC bus, and
 * reset the consumed precomputed session (rebuilt by the polling task).
 */
void NfcManager::handleHomeKeyAuth(const std::vector<uint8_t>& select_response) {
    auto publishAuthResult = [](
        const ddk::AuthOutcome& authResult,
        const std::vector<uint8_t>& readerId
    ) {
        if (authResult.state != ddk::FlowState::Failed) {
            ESP_LOGI(TAG, "HomeKey authentication successful!");
            EventHKTap s{.status = true, .issuerId = authResult.issuer->id, .endpointId = authResult.endpoint->id, .readerId = readerId };
            std::vector<uint8_t> d;
            alpaca::serialize(s, d);
            NfcEvent event{.type=HOMEKEY_TAP, .data=d};
            std::vector<uint8_t> event_data;
            alpaca::serialize(event, event_data);
            AppEventLoop::publish(NFC_EVENT, NFC_TAP_EVENT, event_data.data(), event_data.size());
        } else {
            ESP_LOGW(TAG, "HomeKey authentication failed.");
            EventHKTap s{.status = false, .issuerId = {}, .endpointId = {}, .readerId = {} };
            std::vector<uint8_t> d;
            alpaca::serialize(s, d);
            NfcEvent event{.type=HOMEKEY_TAP, .data=d};
            std::vector<uint8_t> event_data;
            alpaca::serialize(event, event_data);
            AppEventLoop::publish(NFC_EVENT, NFC_TAP_EVENT, event_data.data(), event_data.size());
        }
    };

    auto runAuth = [&](ddk::Profile& profile, ddk::Session& session) {
        auto startTime = std::chrono::high_resolution_clock::now();
        auto err = profile.validate_select(session, select_response);
        if (err != ddk::FailureReason::None) {
          ESP_LOGE(TAG, "Profile Rejected SELECT Response");
          return;
        }
        auto state = ddk::FlowState::Selected;
        while (state != ddk::FlowState::Done && state != ddk::FlowState::Failed) {
            state = profile.step(session, state);
        }

        auto outcome = profile.finalize(session);
        m_lastTxnOutcome = outcome ? TxnOutcome::Success : TxnOutcome::Failure;
        if (outcome) {
            ESP_LOGI(TAG, "Endpoint authenticated in %lli ms", std::chrono::duration_cast<std::chrono::milliseconds>(std::chrono::high_resolution_clock::now() - startTime).count());
            publishAuthResult(outcome, m_readerDataManager.reader_identity().sub_identifier);
        }
        // No extra control-flow command here: Profile::step already sent the
        // success/failure CONTROL FLOW, and a second one is answered 6A82.
    };

    auto authenticateCold = [&]() {
        auto session = buildAuthSession();
        auto profile = ddk::homekey::make_profile();
        runAuth(*profile, *session);
    };

    if (m_hkAuthPrecomputeEnabled) {
        const uint32_t genNow = m_readerDataGeneration.load(std::memory_order_relaxed);
        if (m_cachedSession && m_cachedSessionGeneration == genNow) {
            ESP_LOGI(TAG, "Auth cache hit (gen=%u).", genNow);
            auto profile = ddk::homekey::make_profile();
            runAuth(*profile, *m_cachedSession);
            m_cachedSession.reset();
            return;
        }
        ESP_LOGI(TAG, "Auth cache miss (gen=%u) -> cold init.", genNow);
    }
    authenticateCold();
}

/**
 * @brief Publish a TAG_TAP NFC event for a detected non-HomeKey (generic) tag.
 *
 * Constructs an EventTagTap containing the tag UID, ATQA, and SAK, serializes it
 * into an NfcEvent payload, and publishes the serialized event to the NFC event
 * topic.
 */
void NfcManager::handleGenericTag(const std::vector<uint8_t>& uid, const std::array<uint8_t,2>& atqa, const uint8_t& sak) {
    EventTagTap s{.uid = uid, .atqa = atqa, .sak = sak};
    std::vector<uint8_t> d;
    alpaca::serialize(s, d);
    NfcEvent event{.type=TAG_TAP, .data=d};
    std::vector<uint8_t> event_data;
    alpaca::serialize(event, event_data);
    AppEventLoop::publish(NFC_EVENT, NFC_TAP_EVENT, event_data.data(), event_data.size());
}
